In [1]:
import pandas as pd
tabela = pd.read_excel("amigos.xlsx")
display(tabela)

   id_amigo      nome  tempo_amizade  idade
0         1   alisson              6     16
1         2      enzo              1     16
2         3    felipe              1     16
3         4     lucas              1     17
4         5    arthur              1     16
5         6   larissa              3     17
6         7  cristina              6     17

In [2]:
display(tabela["nome"])

0     alisson
1        enzo
2      felipe
3       lucas
4      arthur
5     larissa
6    cristina
Name: nome, dtype: object

In [3]:
tabela.dropna()
tabela.loc[tabela["tempo_amizade"] == 1, "idade"] = 17
display(tabela)
tabela.to_excel("Amigos001.xlsx")

   id_amigo      nome  tempo_amizade  idade
0         1   alisson              6     16
1         2      enzo              1     17
2         3    felipe              1     17
3         4     lucas              1     17
4         5    arthur              1     17
5         6   larissa              3     17
6         7  cristina              6     17